const solutions = {
    case0: function(A, B, C, D) {
        currentProblemType = 0;
        currentValues = {A, B, C, D};
    return `
        ΠΡΟΓΡΑΜΜΑ ΕΜΦΑΝΙΣΗ_ΑΡΙΘΜΩΝ
        ΜΕΤΑΒΛΗΤΕΣ
        ΑΚΕΡΑΙΕΣ: i,j
        ΑΡΧΗ

        i <- ${A}

        ΟΣΟ i <= ${B} ΕΠΑΝΑΛΑΒΕ

            j <- ${C}

            ΟΣΟ j <= ${D} ΕΠΑΝΑΛΑΒΕ
                ΓΡΑΨΕ j
                j <- j + 1
            ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ

            i <- i + 1

        ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ

        ΤΕΛΟΣ_ΠΡΟΓΡΑΜΜΑΤΟΣ`;
    },


    // ==============================
    // CASE 1 - Nested UNTIL
    // ==============================
    case1: function(N, M) {
        currentProblemType = 1;
        currentValues = {N, M};
        return `
        ΠΡΟΓΡΑΜΜΑ ΑΘΡΟΙΣΜΑ_ΟΜΑΔΩΝ
        ΜΕΤΑΒΛΗΤΕΣ
        ΑΚΕΡΑΙΕΣ: i, j, x, sum
        ΑΡΧΗ

        ΑΘΡ <- 0
        i<- 0

        ΑΡΧΗ_ΕΠΑΝΑΛΗΨΗΣ
            i <- i + 1
            j <- 0

            ΑΡΧΗ_ΕΠΑΝΑΛΗΨΗΣ
                j <- j + 1
                ΔΙΑΒΑΣΕ x
                ΑΘΡ <- ΑΘΡ + x
               
            ΜΕΧΡΙΣ_ΟΤΟΥ j > ${M}

            

        ΜΕΧΡΙΣ_ΟΤΟΥ i > ${N}

        ΓΡΑΨΕ ΑΘΡ

        ΤΕΛΟΣ_ΠΡΟΓΡΑΜΜΑΤΟΣ`;
    },


    // ==============================
    // CASE 2 - Nested FOR
    // ==============================
    case2: function(X, Z, F, G, Y) {
        currentProblemType = 2;
        currentValues = {X, Z, F, G, Y};
        return `
        ΠΡΟΓΡΑΜΜΑ ΑΘΡΟΙΣΜΑ_ΜΕ_ΓΙΑ
        ΜΕΤΑΒΛΗΤΕΣ
        ΑΚΕΡΑΙΕΣ: Ι, Ξ, ΑΘΡ
        ΑΡΧΗ

        ΓΙΑ Ι ΑΠΟ ${X} ΜΕΧΡΙ ${Z}

            ΑΘΡ <- 0

            ΓΙΑ Ξ ΑΠΟ ${F} ΜΕΧΡΙ ${G} ΜΕ_ΒΗΜΑ ${Y}
                ΑΘΡ <- ΑΘΡ + Ξ
            ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ

            ΓΡΑΨΕ ΑΘΡ

        ΤΕΛΟΣ_ΕΠΑΝΑΛΗΨΗΣ

        ΤΕΛΟΣ_ΠΡΟΓΡΑΜΜΑΤΟΣ`;
    }
};